subjects = {
    "subject1": {
        "Day": "Пон",
        "Time": "10.00-11.30",
        "NumberOfWeeks": "2 4 6 8 10 12 14 16",
        "Room": "2435/4 (бывш. 431в) ауд.",
        "Lesson": "Информатика(лаб)",
        "Teacher": "Болдырева Елена Александровна",
        "Location": "Кронверский пр. д.49 лит.А",
    },
    "subject2": {
        "Day": "Пон",
        "Time": "11.40-13.10",
        "NumberOfWeeks": "2 4 6 8 10 12 14 16",
        "Room": "2435/4 (бывш. 431в) ауд.",
        "Lesson": "Информатика(лаб)",
        "Teacher": "Болдырева Елена Александровна",
        "Location": "Кронверский пр. д.49 лит.А",
    },
    "subject3": {
        "Day": "Пон",
        "Time": "15.20-16.50",
        "NumberOfWeeks": "3 5 7 9 11 13 15 17",
        "Room": "2306/2 (бывш. 305) ауд.",
        "Lesson": "Основы профессиональной деятельности(лаб)",
        "Teacher": "Ткешелшвили Нино Мерабиевна",
        "Location": "Кронверский пр. д.49 лит.А",
    },
    "subject4": {
        "Day": "Пон",
        "Time": "17.00-18.30",
        "NumberOfWeeks": "3 5 7 9 11 13 15 17",
        "Room": "2306/2 (бывш. 305) ауд.",
        "Lesson": "Основы профессиональной деятельности(лаб)",
        "Teacher": "Ткешелшвили Нино Мерабиевна",
        "Location": "Кронверский пр. д.49 лит.А",
    }
}